Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: To display or hide the dragbar, check or uncheck the Dragbar Visible menu item.
ru_ru: Для того, чтобы скрыть или отобразить панель «Dragbar» поставьте или снимите отметку на пункте меню Отобразить панель Dragbar.

source: To display or hide the toolbar, check or uncheck the Toolbar Visible menu item.
ru_ru: Для отображения или скрытия панели инструментов поставьте или снимите отметку с пункта меню Панель инструментов.

source: To do so:
ru_ru: Для этого:

source: To edit an entry-specific shortcut, double-click on the desired row.
ru_ru: Для редактирования комбинации клавиш элемента щёлкните дважды на соответствующей строке.

source: To edit an existing filter, select is and then click on Edit.
ru_ru: Для редактирования существующего фильтра следует выбрать его в верхней таблице и нажать кнопку «Правка».

source: To export data use the "File → Export To" menu.
ru_ru: Для экспорта данных следует использовать пункт меню «Файл»→«Экспортировать в».

source: To export data use the File->Export To menu.
ru_ru: Для экспорта данных следует использовать пункт меню «Файл»→«Экспортировать в».

source: To export password entries use the "File → Export To" menu.
ru_ru: Для экспорта элементов используйте пункт меню «Файл→Экспортировать в».

source: To have Password Safe generate a password, just click on Generate in the Edit/View Entry dialog.
ru_ru: Для того, чтобы Password Safe создал новый пароль, нажмите кнопку Создать в диалоге Редактирование/просмотр элемента.

source: To import an older format XML file with date/time fields, you must manually edit these fields to convert to the old PasswordSafe format to the W3C standard format.
ru_ru: Для импорта файлов, содержащих дату/время в «старом» стиле, вам необходимо вручную преобразовать содержимое этих полей к представлению по стандарту W3C.

source: To import any data into Password Safe, the Title and Password fields must be present and neither blank nor empty, as it would be if adding a new entry to an existing database.
ru_ru: При импорте данных в Password Safe должны присутствовать и содержать непустые значения поля «Group/Title» (заголовок) и «Password» (пароль). Это ограничение вызвано требованиями к содержанию элементов, созданных стандартным способом.

source: To learn more about a specific tab select it below:
ru_ru: Для получения информации о настройках на той или иной вкладке перейдите по соответствующей ссылке.

source: To load an externally stored filter: Click on the Import button.
ru_ru: Для загрузки фильтра из внешнего файла нажмите кнопку «Импорт».

source: To open a Password Safe database protected with your Yubikey:
ru_ru: Чтобы открыть контейнер Password Safe, защищённый YubiKey:

source: To overcome this, you may specify a delimiter to separate multiple lines when exporting them.
ru_ru: Для упрощения сортировки вы можете указать разделитель, который будет вставляться между строками.

source: To perform a more advance search, such as restricting the search to a subset of entries, determine which fields to search, etc., click on the "..." icon.
ru_ru: Если требуется указать дополнительные параметры поиска (ограничить подмножество элементов или выбрать отдельные поля элементов), щёлкните по значку «...».

source: To quit, please use the Esc key.
ru_ru: Выход производится по кнопке Esc.

source: To realize the input of such characters, you would need a foreign keyboard.
ru_ru: Чтобы ввести такие символы, требуется соответствующая раскладка клавиатуры.

source: To revert all shortcuts to their default values, click on 'Reset All Program Shortcuts'.
ru_ru: Для возврата всем действиям комбинаций клавиш, заданных по умолчанию, нажмите на кнопку «Сбросить горячие клавиши меню».

source: To revert all shortcutsto their default values, click on 'Reset All'.
ru_ru: Кнопка «Сбросить все» возвращает всем действиям комбинаций клавиш, заданные по умолчанию.

source: To revert all shortcuts to their default values, click on 'Reset All'.
ru_ru: Для возврата всем действиям комбинаций клавиш, заданных по умолчанию, нажмите на кнопку «Сбросить все».

source: To search an open Safe, press Ctrl-F (or "Edit → Find...").
ru_ru: Для поиска в открытом контейнере нажмите Ctrl+F (или «Правка→Поиск»).

source: To search an open Safe, press Ctrl-F (or Edit->Find...).
ru_ru: Для поиска в открытом контейнере нажмите Ctrl-F (или «Изменить»→«Поиск»).

source: To see the password associated with the Entry click Show Password.
ru_ru: Для просмотра связанного с этим элементом пароля нажмите кнопку Показать.

source: To see the password associated with the entry click Show Password when editing it.
ru_ru: Для просмотра пароля редактируемого элемента нажмите кнопку Показать.

source: To setup a master password in a secure way, you could use accented characters (e.g. on a German keyboard) such as ?, ? or similar.
ru_ru: Внутри мастер-пароля вы можете использовать символы иностранных алфавитов, например, ä, ö для немецкой раскладки.

source: To setup a master password in a secure way, you could use accented characters (e.g. on a German keyboard) such as ü, ß or similar.
ru_ru: Внутри мастер-пароля вы можете использовать символы иностранных алфавитов, например, ü, ß для немецкой раскладки.

source: To setup a master password in a secure way, you could use character (e.g. on a German keyboard) as ä, ö or simular.
ru_ru: Внутри мастер-пароля вы можете использовать символы иностранных алфавитов, например, ä, ö для немецкой раскладки.

source: To store filters in an external file: Set the Export checkbox of the filters you wish to store externally, then click on the Export button.
ru_ru: Для сохранения фильтра во внешнем файле установите флажок в столбце «Экспорт» и нажмите кнопку «Экспорт».

source: To store filters in the current database: Set the Copy to DB checkbox, and then click on the Copy button.
ru_ru: Для сохранения фильтра в текущем контейнере установите флажок в столбце «Копировать в контейнер» и нажмите кнопку «Копировать».

source: To switch from one YubiKey to another:
ru_ru: Для привязки другого YubiKey:

source: To the user, it looks like a small, thin, disk-on-key with a button on top.
ru_ru: Для пользователя YubiKey на небольшую флешку с кнопкой на одной из сторон.

source: To toggle between case-sensitive and case-insensitive search, press on the 'AA' button, which changes to 'Aa' when the search is case-sensitive.
ru_ru: Для переключения между регистрозависимым и регистронезависимым поиском щёлкните по кнопке с надписью «AA». При переключении на регистрозависимый поиск надпись изменяется на «Aa». (При использовании «современных» значков на кнопке изображены буквы «TT».)

source: To use "new" or "classic" toolbar icons, select the "New toolbar" or "Classic toolbar" menu item, respectively.
ru_ru: Для использования «современного» или «классического» набора значков, выберите Современная панель инструментов или Классическая панель инструментов соответственно.

source: To use a '$' in the string as normal text (not indicating that the following text is a variable name), escape it using a back-slash ('\') e.g. '\$text' becomes '$text' and is not treated as a variable called 'text'.
ru_ru: Для использования знака «$» как обычного символа в строке (чтобы он не указывал на имя переменной), экранируйте его символом «\». Например, «\$text» рассматривается как «$text», а не как переменная с именем «text».

source: To use a '$' in the string as normal text (not indicating that the following text is a variable name), escape it using a back-slash ('\') e.g., '\$text' becomes '$text' and is not treated as a variable called 'text'.
ru_ru: Для использования знака «$» как обычного символа в строке (чтобы он не указывал на имя переменной), экранируйте его символом «\». Например, «\$text» рассматривается как «$text», а не как переменная с именем «text».

source: To use a back-slash before a '$' as a back-slash, escape it with a back-slash e.g. '\\$name' becomes '\$name' in the resulting text and '$name' is treated as a variable.
ru_ru: Для того чтобы вставить «\» перед символом «$», экранируйте его с помощью символа «\». «\\$name» рассматривается как «\$name» в конечном тексте, при этом «$name» считается переменной.

source: To use a variable immediately followed by an alphanumeric character in the Run Command, enclose the variable's name in curly brackets e.g., '${varname}string'.
ru_ru: В случае, если требуется добавить букву или цифру сразу после значения переменной, заключите имя переменной в фигурные скобки, например, «${varname}строка».

source: To use your configured YubiKey to protect your database:
ru_ru: Для использования настроенного YubiKey:

source: Toggle between List and Tree views.
ru_ru: Переключить режима просмотра (список/дерево)

source: Toolbar Icons
ru_ru: Значки панели инструментов

source: Tree & List View font size in tenths of a point
ru_ru: Размер шрифта для элементов дерева/списка в десятых долях пункта

source: True if the user has defined a Hot Key to get quick access to Password Safe
ru_ru: True [истина], если назначена горячая клавиша для вызова Password Safe

source: True if the user has defined a Hot Key to get quick access to Pasword Safe
ru_ru: True [истина], если назначена горячая клавиша для вызова Pasword Safe

source: Twofish is a fast, free alternative to the AES, DES and IDEA encryption algorithms.
ru_ru: Twofish — быстрый и свободный алгоритм шифрования, являющийся альтернативой AES, DES и IDEA.

source: URL
ru_ru: Ссылка

source: Under Windows, the following XSLT processors support the supplied XSL Transform files.
ru_ru: Для данных шаблонов на ОС Windows можно использовать следующие XSLT-процессоры.

source: Undo
ru_ru: Вернуть

source: Undo/Redo
ru_ru: Отмена/повтор изменений

source: Unless changed via the "Manage → Options → Security" tab, the entry's password will automatically be copied into the Clipboard.
ru_ru: Если в диалоге Сервис→Настройки→Безопасность не указано иное, пароль автоматически копируется в буфер обмена.

source: Unlike other variables, this one will be able to take a value to override the entry's current value.
ru_ru: В отличие от других переменных, она может принимать дополнительный параметр для изменения значения по умолчанию.

source: Unlike shortcuts, which refer to the base entry for all fields, aliases have their own values for all fields except for its password, which is its base's.
ru_ru: В отличие от ярлыков, которые наследуют значения для всех полей, псевдонимы могут иметь свои значения во всех полях кроме пароля, который наследуется от исходного элемента.

source: Unlock Difficulty
ru_ru: Сложность перебора для мастер-пароля

source: Unlocked System Tray
ru_ru: Контекстное меню для разблокированного контейнера

source: Unlocked database
ru_ru: Разблокированный контейнер

source: Unsaved changes
ru_ru: Несохранённые изменения

source: Up Arrow
ru_ru: Стрелка вверх

source: Up to and including Password Safe version 3.42.1, this is stored as a decimal integer created from the virtual keycode for the character in the lower word plus the Microsoft Foundation Class CHotKeyCtrl modifier flags in the higher word.
ru_ru: До версии Password Safe 3.42.1 (включительно) это значение хранилось как десятичное целое: в младшем слове указывался виртуальный код символа, в старшем — флаги CHotKeyCtrl [Microsoft Foundation Class].

source: Up-arrow key
ru_ru: Клавиша вверх

source: Upgrading From Previous Versions of Password Safe
ru_ru: Переход на новые версии Password Safe

source: Upgrading From previous versions of Password Safe
ru_ru: Переход на новые версии Password Safe

source: Upgrading from previous versions
ru_ru: Переход на новые версии Password Safe

source: Upgrading from previous versions of Password Safe
ru_ru: Переход на новые версии Password Safe

source: Upon Startup, Password Safe searches for a file named autoload_filters.xml in the same directory as the pwsafe.cfg file (by default the directory where Password Safe is installed).
ru_ru: При старте Password Safe проверяет наличие файла autoload_filters.xml в каталоге с файлом настроек pwsafe.cfg (по умолчанию это каталог, в который был установлен Password Safe).

source: Use %20 for the space character.
ru_ru: Так, вместо символа «пробел» следует указывать %20.

source: Use Ctrl + C
ru_ru: Нажмите Ctrl+C

source: Use Ctrl + U
ru_ru: Нажмите Ctrl+U

source: Use AutoType string specified between the round brackets.
ru_ru: Использовать строку автонабора, указанную в круглых скобках.

source: Use New or Classic toolbar
ru_ru: Использовать «классическую» или «современную» панель инструментов

source: Use Secure Desktop for master passphrase
ru_ru: Использовать «Защищённый рабочий стол»

source: Use a delimiter to replace the 'newline' character in a multi-line Notes field and the period ('.') if present in the Title field.
ru_ru: Для замены переносов строк в многострочных заметках и точки («.») в заголовках используется разделитель.

source: Use a delimiter to replace the “newline” character in a multi-line Notes field and the period (‘.’) if present in the Title field. The default is ‘»’ [Alt+0187], which may be overridden if needed.
ru_ru: Использует разделитель для замены переносов строк в многострочных заметках и точки («.») в заголовках. По умолчанию используется символ ‘»’ [Alt+0187], который может быть переопределён.

source: Use autotype string specified between the round brackets.
ru_ru: Использовать строку автонабора, указанную в круглых скобках.

source: Use current entry value (used if text immediately follows the '$a' variable).
ru_ru: Использовать значение из текущего элемента (фигурные скобки нужны, если за «$a» следует текст).

source: Use current entry value.
ru_ru: Использовать значение из текущего элемента.

source: Use the default user text preference when adding a new entry
ru_ru: Использование имени пользователя по умолчанию

source: Use the time of the import operation
ru_ru: Использовать время импорта

source: User Name:
ru_ru: Имя пользователя:

source: User Names
ru_ru: Имя пользователя

source: User Names and Passwords
ru_ru: Имена пользователей и пароли

source: User Names, Passwords, and Groups
ru_ru: Имена пользователей, пароли и группы

source: User Names, Passwords, and Groups: Additional
ru_ru: Имена пользователей, пароли и группы: дополнительно

source: User Names, Passwords, and Groups: Basic
ru_ru: Имена пользователей, пароли и группы: основные

source: User Names, Passwords, and Groups: Dates and Times
ru_ru: Имена пользователей, пароли и группы: дата и время

source: User Names, Passwords, and Groups: Password Policy
ru_ru: Имена пользователей, пароли и группы: политика создания паролей

source: User defined Filters
ru_ru: Фильтры пользователя

source: Username
ru_ru: Имя пользователя

source: Username is displayed in Tree View
ru_ru: Отображение имени пользователя в древовидном списке

source: Username, passwords and groups together with the additional parameters are managed in 4 tabs:
ru_ru: Имена пользователей, пароли и группы, а также другие параметры настраиваются на четырёх вкладках:

source: Users have reported problems with the interaction of popup-blockers with the AutoType functionality.
ru_ru: (есть сообщения пользователей, указывающие на то, что блокирование всплывающих окон может привести к проблемам с автонабором).

source: Users have reported problems with the interaction of popup-blockers with the autotype functionality.
ru_ru: (есть сообщения пользователей, указывающие на то, что блокирование всплывающих окон может привести к проблемам с автонабором).

source: Using Password Safe you can organize your passwords using your own customizable references—for example, by user ID, category, web site, or location.
ru_ru: С помощью Password Safe вы можете упорядочить свои пароли по различным настраиваемым полям, например, по имени пользователя, категории, веб-сайту, или расположению.

source: Using Auto Type
ru_ru: Использование автонабора

source: Using AutoType
ru_ru: Использование автонабора

source: Using Password Safe
ru_ru: Использование Password Safe

source: Using Passwords
ru_ru: Использование паролей

source: Using Run Command
ru_ru: Выполнение команд

source: Using Stored Passwords
ru_ru: Использование сохранённых паролей

source: Using YubiKey
ru_ru: Использование YubiKey

source: Using YubiKey with PasswordSafe
ru_ru: Использование YubiKey с Password Safe

source: Using either method causes the Safe Combination Set Up dialog to appear.
ru_ru: В любом из этих случаев будет выведен диалог Установка пароля для контейнера.

source: Using the same password over and over again across a wide spectrum of systems and web sites creates the nightmare scenario where once someone has figured out one password, they have figured out all your passwords and now have access to every part of your life (system, e-mail, retail, financial, work).
ru_ru: Использование одного и того же пароля на всех компьютерах и веб-сайтах может привести к реализации кошмарного сценария, в котором кто-то, разгадав этот пароль, получает доступ ко всему, что у вас есть (компьютерам, электронной почте, финансам, рабочим файлам).

source: Usually the current database name is used to prefix any backup file names.
ru_ru: По умолчанию приставка для имён резервных копий контейнеров совпадает с именем контейнера.

source: Usually the database backup is stored in the same directory as the database.
ru_ru: По умолчанию резервные копии создаются в том же каталоге, где находится открытый в настоящий момент контейнер.

source: V3.26 and V3.27 can input either format but for versions after 3.27, it will only accept the W3C standard.
ru_ru: Версии 3.26 и 3.27 могли импортировать данные в любом из этих представлений, но с версии 3.27 поддерживается только формат из стандарта W3C.

source: Validate
ru_ru: Проверить...

source: Validate...
ru_ru: Проверить

source: Value is between 1970 and 2038.
ru_ru: Значение от 1970 до 2038.

source: Values are: AllCollapsed, AllExpanded or AsPerLastSave
ru_ru: Возможные значения: «AllCollapsed» [полностью свёрнуто], «AllExpanded» [полностью развёрнуто] или «AsPerLastSave» [как в прошлый раз]

source: Values are: AllColpased, AllExpanded or AsPerLastSave
ru_ru: Возможные значения: «AllColpased» [полностью свёрнуто], «AllExpanded» [полностью развёрнуто] или «AsPerLastSave» [как в прошлый раз]

source: Values are: None, datetime or an incremental number
ru_ru: Возможные значения: «None» [нет], «datetime» [дата и время] или «incremental number» [по счётчику]

source: Values greater than 50% are not supported.
ru_ru: Значения прозрачности более 50 % не поддерживаются.

source: Variable names always start with an alphabetic character and the remaining characters are alphanumeric.
ru_ru: Имя переменной должно начинаться с буквы, в последующих символах имени можно использовать буквы и цифры.

source: Variables are specified as '$name' and are case sensitive.
ru_ru: Имена переменных имеют вид «$name» и являются регистрозависимыми.

source: Various miscellaneous program defaults are displayed in the Misc Tab.
ru_ru: На вкладке Разное настраиваются действия и значения по умолчанию.

source: Version 1.x of Password Safe can only read databases generated by versions 1.x.
ru_ru: Версия Password Safe 1.x поддерживает чтение контейнеров, созданных в версии 1.x.

source: Version 2.x of Password Safe can read databases created by itself, and by version 1.x of Password Safe
ru_ru: Версия Password Safe 2.x может читать контейнеры, созданные в версиях 2.x и 1.x.

source: Version 3.x of Password Safe can read databases created by all previous versions.
ru_ru: Версия Password Safe 3.x может читать контейнеры всех предыдущих форматов.

source: Via the Find Toolbar Button
ru_ru: С помощью кнопки на панели поиска

source: Via the Wizard during Compare, Merge, Synchronize and Export to Text/XML
ru_ru: В мастере при сравнении, слиянии, синхронизации и экспорте в простой текст или XML

source: Via this dialog, one can edit the current database default password policy and create, edit or delete any new "Named" policies.
ru_ru: Здесь вы можете редактировать политику по умолчания для текущего контейнера, а также создавать, редактировать и удалять «именованные» политики.

source: View Menu
ru_ru: Меню «Вид»

source: View Password Entries
ru_ru: Просмотр элементов

source: View Reports
ru_ru: Просмотр отчётов

source: View reports of import and merge operations.
ru_ru: Просмотр отчётов об операциях импорта и слияния

source: View the entry (the comparison database is always in R-O mode as we are unable to provide the Undo facility if it is changed).
ru_ru: Просмотр элемента (сравниваемый контейнер всегда открывается в режиме «только чтение», т. к. для него недоступна отмена последнего действия).

source: View the entry (the comparison database is always in R-O mode as we are unable to provide the Undo facitility if it is changed).
ru_ru: Просмотр элемента (сравниваемый контейнер всегда открывается в режиме «только чтение», т. к. для него недоступна отмена последнего действия).

source: View the entry if the database is in R-O mode or the entry is protected
ru_ru: Просмотр элемента, если контейнер открыт в режиме «только чтение», или элемент является защищённым.

source: View the results of merge, compare, import and validate operations.
ru_ru: Просмотр отчётов об операциях слияния, сравнения, импорта и проверки.

source: View/Edit selected entry
ru_ru: Просмотр/редактирование элемента

source: Virtual Keyboard
ru_ru: Экранная клавиатура

source: Virtual keyboard
ru_ru: Экранная клавиатура

source: Virtual keyboard font size in tenths of a point
ru_ru: Размер шрифта для экранной клавиатуры в десятых долях пункта

source: Visit Password Safe Website...
ru_ru: Посетить сайт Password Safe

source: Warn N days before password expires
ru_ru: Предупреждать за N дней до истечения пароля

source: Warn user on database open if there are any entries with expired or soon to expire passwords
ru_ru: При открытии контейнера предупреждать об истёкших или истекающих паролях

source: Warning messages will be placed in the Import log show which entries have been affected.
ru_ru: Список затронутых элементов будет помещён в отчёт об импорте.

source: We recommend that you only select combinations from those listed here.
ru_ru: Поэтому, рекомендуется использовать только перечисленные ниже сочетания.

source: Welcome
ru_ru: Приветствие

source: When Password Safe exits normally, you are prompted if there are unsaved changes to the database.
ru_ru: При нормальном выходе из Password Safe, вам будет предложено сохранить изменения в контейнере.

source: When Checked, the database will be saved if there is any change e.g. add, delete, duplicate, edit or rename of an entry or group as well as if any entries/groups are added/moved via import or Drag & Drop.
ru_ru: Если включено, сохранение происхоидт при любом изменении, будь то вставка, удаление, дублирование, редактирование или переименование элемента или группы, в том числе, если вставка или перемещение произошли с помощью импорта или перетягивания из другой группы/контейнера.

source: When PasswordSafe exits normally, you are prompted if there are unsaved changes to the database.
ru_ru: При нормальном выходе из Password Safe, вам будет предложено сохранить изменения в контейнере.

source: When a Group is selected (in Tree view), this will delete all entries under the selected group.
ru_ru: Если в древовидном списке выбрана группа, то группа и все элементы внутри неё будут удалены.

source: When a Group is selected (in Tree view), this will expand or collapse the display of entries under the selected group.
ru_ru: Если при древовидном просмотре выбрана группа, сворачивает или разворачивает список элементов для текущей группы.
